# SetMaterialTexture

## Description
```pascal
FUNCTION SetMaterialTexture(
				VAR materialHandle : HANDLE;
				textureIndex       : LONGINT) : BOOLEAN;
```

```python

def vs.SetMaterialTexture(materialHandle, textureIndex):
    return (BOOLEAN, materialHandle)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|materialHandle|HANDLE||
|textureIndex|LONGINT||

## Version
Availability: from Vectorworks 2021
## Category
* Object Attributes